[Killed] Block removal mutation
GildedRose.cs:14:9
         private readonly IList<Item> _items;
 
         public GildedRose(IList<Item> items)
-        {
-            _items = items;
-        }
+        {}
 
         public void UpdateQuality()

[Killed] Block removal mutation
GildedRose.cs:19:9
         }
 
         public void UpdateQuality()
-        {
-            foreach (var t in _items)
-            {
-                if (t.Name == SulfurasHandOfRagnaros)
-                    continue;
-
-                ANewDay(t);
-
-                switch (t.Name)
-                {
-                    case AgedBrie:
-                        UpdateAgedBrie(t);
-                        break;
-                    case BackstagePassesToATafkal80EtcConcert:
-                        UpdateBackStageConcert(t);
-                        break;
-                    default:
-                        UpdateCommonItem(t);
-                        break;
-                }
-            }
-        }
+        {}
 
         private static void ANewDay(Item t)

[Killed] Block removal mutation
GildedRose.cs:21:13
         public void UpdateQuality()
         {
             foreach (var t in _items)
-            {
-                if (t.Name == SulfurasHandOfRagnaros)
-                    continue;
-
-                ANewDay(t);
-
-                switch (t.Name)
-                {
-                    case AgedBrie:
-                        UpdateAgedBrie(t);
-                        break;
-                    case BackstagePassesToATafkal80EtcConcert:
-                        UpdateBackStageConcert(t);
-                        break;
-                    default:
-                        UpdateCommonItem(t);
-                        break;
-                }
-            }
+            {}
         }
 

[Killed] Equality mutation
GildedRose.cs:22:21
         {
             foreach (var t in _items)
             {
-                if (t.Name == SulfurasHandOfRagnaros)
+                if (t.Name != SulfurasHandOfRagnaros)
                     continue;
 

[Killed] Statement mutation
GildedRose.cs:23:21
             foreach (var t in _items)
             {
                 if (t.Name == SulfurasHandOfRagnaros)
-                    continue;
+                    ;
 
                 ANewDay(t);

[Killed] Statement mutation
GildedRose.cs:25:17
                 if (t.Name == SulfurasHandOfRagnaros)
                     continue;
 
-                ANewDay(t);
+                ;
 
                 switch (t.Name)

[Killed] Statement mutation
GildedRose.cs:30:25
                 switch (t.Name)
                 {
                     case AgedBrie:
-                        UpdateAgedBrie(t);
+                        ;
                         break;
                     case BackstagePassesToATafkal80EtcConcert:

[Killed] Statement mutation
GildedRose.cs:33:25
                         UpdateAgedBrie(t);
                         break;
                     case BackstagePassesToATafkal80EtcConcert:
-                        UpdateBackStageConcert(t);
+                        ;
                         break;
                     default:

[Killed] Statement mutation
GildedRose.cs:36:25
                         UpdateBackStageConcert(t);
                         break;
                     default:
-                        UpdateCommonItem(t);
+                        ;
                         break;
                 }

[Killed] Block removal mutation
GildedRose.cs:43:9
         }
 
         private static void ANewDay(Item t)
-        {
-            t.SellIn--;
-        }
+        {}
 
         private static bool IsExpired(Item t)

[Killed] Statement mutation
GildedRose.cs:44:13
 
         private static void ANewDay(Item t)
         {
-            t.SellIn--;
+            ;
         }
 

[Killed] PostDecrementExpression to PostIncrementExpression mutation
GildedRose.cs:44:13
 
         private static void ANewDay(Item t)
         {
-            t.SellIn--;
+                        t.SellIn++;
         }
 

[Killed] Block removal mutation
GildedRose.cs:48:9
         }
 
         private static bool IsExpired(Item t)
-        {
-            return t.SellIn < 0;
-        }
+        {}
 
         private static void UpdateBackStageConcert(Item t)

[Killed] Equality mutation
GildedRose.cs:49:20
 
         private static bool IsExpired(Item t)
         {
-            return t.SellIn < 0;
+            return t.SellIn <= 0;
         }
 

[Killed] Equality mutation
GildedRose.cs:49:20
 
         private static bool IsExpired(Item t)
         {
-            return t.SellIn < 0;
+            return t.SellIn > 0;
         }
 

[Killed] Block removal mutation
GildedRose.cs:53:9
         }
 
         private static void UpdateBackStageConcert(Item t)
-        {
-            if (IsExpired(t))
-            {
-                t.Quality = 0;
-                return;
-            }
-
-            IncreaseQuality(t);
-            if (t.SellIn < 10) IncreaseQuality(t);
-
-            if (t.SellIn < 5) IncreaseQuality(t);
-        }
+        {}
 
         private static void UpdateAgedBrie(Item t)

[Killed] Negate expression
GildedRose.cs:54:17
 
         private static void UpdateBackStageConcert(Item t)
         {
-            if (IsExpired(t))
+            if (!(IsExpired(t)))
             {
                 t.Quality = 0;

[Killed] Block removal mutation
GildedRose.cs:55:13
         private static void UpdateBackStageConcert(Item t)
         {
             if (IsExpired(t))
-            {
-                t.Quality = 0;
-                return;
-            }
+            {}
 
             IncreaseQuality(t);

[Killed] Statement mutation
GildedRose.cs:57:17
             if (IsExpired(t))
             {
                 t.Quality = 0;
-                return;
+                ;
             }
 

[Survived] Statement mutation
GildedRose.cs:60:13
                 return;
             }
 
-            IncreaseQuality(t);
+            ;
             if (t.SellIn < 10) IncreaseQuality(t);
 

[Survived] Negate expression
GildedRose.cs:61:17
             }
 
             IncreaseQuality(t);
-            if (t.SellIn < 10) IncreaseQuality(t);
+            if (!(t.SellIn < 10)) IncreaseQuality(t);
 
             if (t.SellIn < 5) IncreaseQuality(t);

[Survived] Statement mutation
GildedRose.cs:61:32
             }
 
             IncreaseQuality(t);
-            if (t.SellIn < 10) IncreaseQuality(t);
+            if (t.SellIn < 10) ;
 
             if (t.SellIn < 5) IncreaseQuality(t);

[Survived] Equality mutation
GildedRose.cs:63:17
             IncreaseQuality(t);
             if (t.SellIn < 10) IncreaseQuality(t);
 
-            if (t.SellIn < 5) IncreaseQuality(t);
+            if (t.SellIn <= 5) IncreaseQuality(t);
         }
 

[Survived] Equality mutation
GildedRose.cs:63:17
             IncreaseQuality(t);
             if (t.SellIn < 10) IncreaseQuality(t);
 
-            if (t.SellIn < 5) IncreaseQuality(t);
+            if (t.SellIn > 5) IncreaseQuality(t);
         }
 

[Killed] Block removal mutation
GildedRose.cs:67:9
         }
 
         private static void UpdateAgedBrie(Item t)
-        {
-            IncreaseQuality(t);
-            if (IsExpired(t))
-                IncreaseQuality(t);
-        }
+        {}
 
         private static void UpdateCommonItem(Item t)

[Killed] Statement mutation
GildedRose.cs:68:13
 
         private static void UpdateAgedBrie(Item t)
         {
-            IncreaseQuality(t);
+            ;
             if (IsExpired(t))
                 IncreaseQuality(t);

[Killed] Negate expression
GildedRose.cs:69:17
         private static void UpdateAgedBrie(Item t)
         {
             IncreaseQuality(t);
-            if (IsExpired(t))
+            if (!(IsExpired(t)))
                 IncreaseQuality(t);
         }

[Killed] Statement mutation
GildedRose.cs:70:17
         {
             IncreaseQuality(t);
             if (IsExpired(t))
-                IncreaseQuality(t);
+                ;
         }
 

[Killed] Block removal mutation
GildedRose.cs:74:9
         }
 
         private static void UpdateCommonItem(Item t)
-        {
-            DecreaseQuality(t);
-            if (IsExpired(t)) DecreaseQuality(t);
-        }
+        {}
 
         private static void IncreaseQuality(Item t)

[Killed] Statement mutation
GildedRose.cs:75:13
 
         private static void UpdateCommonItem(Item t)
         {
-            DecreaseQuality(t);
+            ;
             if (IsExpired(t)) DecreaseQuality(t);
         }

[Killed] Negate expression
GildedRose.cs:76:17
         private static void UpdateCommonItem(Item t)
         {
             DecreaseQuality(t);
-            if (IsExpired(t)) DecreaseQuality(t);
+            if (!(IsExpired(t))) DecreaseQuality(t);
         }
 

[Killed] Statement mutation
GildedRose.cs:76:31
         private static void UpdateCommonItem(Item t)
         {
             DecreaseQuality(t);
-            if (IsExpired(t)) DecreaseQuality(t);
+            if (IsExpired(t)) ;
         }
 

[Killed] Block removal mutation
GildedRose.cs:80:9
         }
 
         private static void IncreaseQuality(Item t)
-        {
-            if (t.Quality < 50) t.Quality++;
-        }
+        {}
 
         private static void DecreaseQuality(Item t)

[Killed] Negate expression
GildedRose.cs:81:17
 
         private static void IncreaseQuality(Item t)
         {
-            if (t.Quality < 50) t.Quality++;
+            if (!(t.Quality < 50)) t.Quality++;
         }
 

[Killed] PostIncrementExpression to PostDecrementExpression mutation
GildedRose.cs:81:33
 
         private static void IncreaseQuality(Item t)
         {
-            if (t.Quality < 50) t.Quality++;
+            if (t.Quality < 50) t.Quality--;
         }
 

[Killed] Block removal mutation
GildedRose.cs:85:9
         }
 
         private static void DecreaseQuality(Item t)
-        {
-            if (t.Quality > 0) t.Quality--;
-        }
+        {}
     }
 }

[Killed] Statement mutation
GildedRose.cs:86:32
 
         private static void DecreaseQuality(Item t)
         {
-            if (t.Quality > 0) t.Quality--;
+            if (t.Quality > 0) ;
         }
     }

[Killed] Equality mutation
GildedRose.cs:86:17
 
         private static void DecreaseQuality(Item t)
         {
-            if (t.Quality > 0) t.Quality--;
+            if (t.Quality < 0) t.Quality--;
         }
     }
